In [1]:
#Importing Libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn.preprocessing import LabelEncoder

In [2]:
df=pd.read_csv("scrapq.csv")

In [3]:
df.head()

        Name      Mobile       City Register Type    Status Category Type
0  ANNAPURNA  9000894567  Hyderabad           CRM  COMPLETE     Residence
1      Rupal  9848283074  Hyderabad          SELF  COMPLETE     Residence
2      SWAMY  9030747436  Hyderabad           CRM  COMPLETE     Residence
3   PRANITHA  4027648868  Hyderabad           CRM  COMPLETE     Residence
4     RAMESH  8008477986  Hyderabad           CRM  COMPLETE     Residence

In [6]:
df.drop('Mobile', inplace= True,axis=1)

In [7]:
df.head()

        Name       City Register Type    Status Category Type
0  ANNAPURNA  Hyderabad           CRM  COMPLETE     Residence
1      Rupal  Hyderabad          SELF  COMPLETE     Residence
2      SWAMY  Hyderabad           CRM  COMPLETE     Residence
3   PRANITHA  Hyderabad           CRM  COMPLETE     Residence
4     RAMESH  Hyderabad           CRM  COMPLETE     Residence

In [9]:
df.isnull().sum()

Name                1
City             1558
Register Type       0
Status              0
Category Type    1510
dtype: int64

In [11]:
df.City.fillna(df.City.value_counts().idxmax(),inplace=True)

In [12]:
df.isnull().sum()

Name                1
City                0
Register Type       0
Status              0
Category Type    1510
dtype: int64

In [ ]:
df.City.fillna(df.City.value_counts().idxmax(),inplace=True)